[Killed] BlockStatement
src/user/user.service.ts:18:61
   ) {}
 
   // Роут 1: Створити користувача (POST)
-  async create(createUserDto: CreateUserDto): Promise<User> {
-    // <-- async
-    // Створюємо екземпляр сутності
-    const newUser = this.usersRepository.create(createUserDto);
-    // Зберігаємо його у БД
-    return this.usersRepository.save(newUser);
-  }
+  async create(createUserDto: CreateUserDto): Promise<User> {}
 
   // Роут 2: Отримати список усіх користувачів (GET /)
killedBy: UserService should create a user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "new@example.com", "firstName": "New", "lastName": "User", "role": "Student"}

Number of calls: 0

[Killed] BlockStatement
src/user/user.service.ts:27:36
   }
 
   // Роут 2: Отримати список усіх користувачів (GET /)
-  async findAll(): Promise<User[]> {
-    // <-- async
-    return this.usersRepository.find();
-  }
+  async findAll(): Promise<User[]> {}
 
   // Роут 3: Отримати профіль за ID (GET /:id)
killedBy: UserService should return all users
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/user/user.service.ts:33:44
   }
 
   // Роут 3: Отримати профіль за ID (GET /:id)
-  async findOne(id: number): Promise<User> {
-    // <-- async
-    // findOneBy - стандартний метод TypeORM
-    const user = await this.usersRepository.findOneBy({ id });
-
-    if (!user) {
-      throw new NotFoundException(`User with ID ${id} not found`);
-    }
-    return user;
-  }
+  async findOne(id: number): Promise<User> {}
 
   // Роут 4: Оновити профіль (PUT /:id)
killedBy: UserService should return a single user by id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": 1}

Number of calls: 0

[Killed] BlockStatement
src/user/user.service.ts:38:16
     // findOneBy - стандартний метод TypeORM
     const user = await this.usersRepository.findOneBy({ id });
 
-    if (!user) {
-      throw new NotFoundException(`User with ID ${id} not found`);
-    }
+    if (!user) {}
     return user;
   }
killedBy: UserService should throw NotFoundException if user is not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] BlockStatement
src/user/user.service.ts:45:70
   }
 
   // Роут 4: Оновити профіль (PUT /:id)
-  async update(id: number, updateData: Partial<User>): Promise<User> {
-    // <-- async
-    const user = await this.usersRepository.findOneBy({ id });
-
-    if (!user) {
-      throw new NotFoundException(`User with ID ${id} not found`);
-    }
-
-    // Оновлюємо властивості об'єкта та зберігаємо зміни
-    Object.assign(user, updateData);
-    return this.usersRepository.save(user);
-  }
+  async update(id: number, updateData: Partial<User>): Promise<User> {}
 
   // Роут 5: Видалити користувача (DELETE /:id)
killedBy: UserService should update a user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": 1}

Number of calls: 0

[NoCoverage] StringLiteral
src/user/user.service.ts:50:35
     const user = await this.usersRepository.findOneBy({ id });
 
     if (!user) {
-      throw new NotFoundException(`User with ID ${id} not found`);
+      throw new NotFoundException(``);
     }
 

[Killed] BlockStatement
src/user/user.service.ts:59:43
   }
 
   // Роут 5: Видалити користувача (DELETE /:id)
-  async remove(id: number): Promise<void> {
-    // <-- async
-    const result = await this.usersRepository.delete(id); // Використовуємо метод delete
-
-    // TypeORM повертає affected: 0, якщо рядок не знайдено
-    if (result.affected === 0) {
-      throw new NotFoundException(`User with ID ${id} not found`);
-    }
-  }
+  async remove(id: number): Promise<void> {}
 }
 
killedBy: UserService should remove a user successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] ConditionalExpression
src/user/user.service.ts:64:9
     const result = await this.usersRepository.delete(id); // Використовуємо метод delete
 
     // TypeORM повертає affected: 0, якщо рядок не знайдено
-    if (result.affected === 0) {
+    if (true) {
       throw new NotFoundException(`User with ID ${id} not found`);
     }
killedBy: UserService should remove a user successfully
statusReason: Error: expect(received).resolves.toBeUndefined()

Received promise rejected instead of resolved
Rejected to value: [NotFoundException: User with ID 1 not found]

[Killed] ConditionalExpression
src/user/user.service.ts:64:9
     const result = await this.usersRepository.delete(id); // Використовуємо метод delete
 
     // TypeORM повертає affected: 0, якщо рядок не знайдено
-    if (result.affected === 0) {
+    if (false) {
       throw new NotFoundException(`User with ID ${id} not found`);
     }
killedBy: UserService should throw NotFoundException if no user was deleted
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined
