[Killed] BlockStatement
src/course/course.service.ts:17:67
   ) {}
 
   // Роут 1: Створити курс (POST)
-  async create(createCourseDto: CreateCourseDto): Promise<Course> {
-    // <-- async
-    // Створюємо екземпляр сутності
-    const newCourse = this.coursesRepository.create(createCourseDto);
-    // Зберігаємо у БД
-    return this.coursesRepository.save(newCourse);
-  }
+  async create(createCourseDto: CreateCourseDto): Promise<Course> {}
 
   // Роут 2: Список усіх курсів (GET /)
killedBy: CourseService should create a course and return it
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"description": "New", "instructorId": 1, "title": "New Course"}

Number of calls: 0

[Killed] BlockStatement
src/course/course.service.ts:26:38
   }
 
   // Роут 2: Список усіх курсів (GET /)
-  async findAll(): Promise<Course[]> {
-    // <-- async
-    // Отримуємо всі курси, одразу завантажуючи пов'язаного інструктора
-    return this.coursesRepository.find({
-      relations: ['instructor'],
-    });
-  }
+  async findAll(): Promise<Course[]> {}
 
   // Роут 3: Деталі курсу за ID (GET /:id)
killedBy: CourseService should return an array of courses
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"relations": ["instructor"]}

Number of calls: 0

[Killed] ArrayDeclaration
src/course/course.service.ts:30:18
     // <-- async
     // Отримуємо всі курси, одразу завантажуючи пов'язаного інструктора
     return this.coursesRepository.find({
-      relations: ['instructor'],
+      relations: [],
     });
   }
killedBy: CourseService should return an array of courses
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "relations": Array [
-     "instructor",

[Killed] BlockStatement
src/course/course.service.ts:35:46
   }
 
   // Роут 3: Деталі курсу за ID (GET /:id)
-  async findOne(id: number): Promise<Course> {
-    // <-- async
-    const course = await this.coursesRepository.findOne({
-      where: { id },
-      // Завантажуємо інструктора та всі уроки, пов'язані з цим курсом
-      relations: ['instructor', 'lessons'],
-    });
-
-    if (!course) {
-      throw new NotFoundException(`Course with ID ${id} not found`);
-    }
-    return course;
-  }
+  async findOne(id: number): Promise<Course> {}
 
   // Роут 4: Оновити курс (PUT /:id)
killedBy: CourseService should return a single course by id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"relations": ["instructor", "lessons"], "where": {"id": 1}}

Number of calls: 0

[Killed] StringLiteral
src/course/course.service.ts:40:19
     const course = await this.coursesRepository.findOne({
       where: { id },
       // Завантажуємо інструктора та всі уроки, пов'язані з цим курсом
-      relations: ['instructor', 'lessons'],
+      relations: ["", 'lessons'],
     });
 
killedBy: CourseService should return a single course by id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,8 +1,8 @@
  Object {
    "relations": Array [

[Killed] ArrayDeclaration
src/course/course.service.ts:40:18
     const course = await this.coursesRepository.findOne({
       where: { id },
       // Завантажуємо інструктора та всі уроки, пов'язані з цим курсом
-      relations: ['instructor', 'lessons'],
+      relations: [],
     });
 
killedBy: CourseService should return a single course by id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "relations": Array [
-     "instructor",

[Killed] ConditionalExpression
src/course/course.service.ts:43:9
       relations: ['instructor', 'lessons'],
     });
 
-    if (!course) {
+    if (false) {
       throw new NotFoundException(`Course with ID ${id} not found`);
     }
killedBy: CourseService should throw a NotFoundException if findOne returns null
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] BooleanLiteral
src/course/course.service.ts:43:9
       relations: ['instructor', 'lessons'],
     });
 
-    if (!course) {
+    if (course) {
       throw new NotFoundException(`Course with ID ${id} not found`);
     }
killedBy: CourseService should return a single course by id
statusReason: NotFoundException: Course with ID 1 not found

[Killed] StringLiteral
src/course/course.service.ts:44:35
     });
 
     if (!course) {
-      throw new NotFoundException(`Course with ID ${id} not found`);
+      throw new NotFoundException(``);
     }
     return course;
killedBy: CourseService should throw a NotFoundException if findOne returns null
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Course with ID 99 not found"
Received message:   "Not Found"

      105 |         } else {
      106 |           stryCov_9fa48("16");
    > 107 |           throw new NotFoundException(stryMutAct_9fa48("17") ? `` : (stryCov_9fa48("17"), `Course with ID ${id} not found`));

[Killed] BlockStatement
src/course/course.service.ts:50:74
   }
 
   // Роут 4: Оновити курс (PUT /:id)
-  async update(id: number, updateData: Partial<Course>): Promise<Course> {
-    // <-- async
-    const course = await this.coursesRepository.findOneBy({ id });
-
-    if (!course) {
-      throw new NotFoundException(`Course with ID ${id} not found`);
-    }
-
-    
-    Object.assign(course, updateData);
-    return this.coursesRepository.save(course);
-  }
+  async update(id: number, updateData: Partial<Course>): Promise<Course> {}
 
   // Роут 5: Видалити курс (DELETE /:id)
killedBy: CourseService should update a course and return the updated version
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": 1}

Number of calls: 0

[Killed] ObjectLiteral
src/course/course.service.ts:52:59
   // Роут 4: Оновити курс (PUT /:id)
   async update(id: number, updateData: Partial<Course>): Promise<Course> {
     // <-- async
-    const course = await this.coursesRepository.findOneBy({ id });
+    const course = await this.coursesRepository.findOneBy({});
 
     if (!course) {
killedBy: CourseService should update a course and return the updated version
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "id": 1,
- }

[Killed] BlockStatement
src/course/course.service.ts:54:18
     // <-- async
     const course = await this.coursesRepository.findOneBy({ id });
 
-    if (!course) {
-      throw new NotFoundException(`Course with ID ${id} not found`);
-    }
+    if (!course) {}
 
     
killedBy: CourseService should throw a NotFoundException on update if course not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Course with ID 99 not found"
Received message:   "Cannot convert undefined or null to object"

      130 |         }
      131 |       }
    > 132 |       Object.assign(course, updateData);

[Killed] BlockStatement
src/course/course.service.ts:64:43
   }
 
   // Роут 5: Видалити курс (DELETE /:id)
-  async remove(id: number): Promise<void> {
-    // <-- async
-    const result = await this.coursesRepository.delete(id);
-
-    if (result.affected === 0) {
-      throw new NotFoundException(`Course with ID ${id} not found`);
-    }
-  }
+  async remove(id: number): Promise<void> {}
 }
 
killedBy: CourseService should delete a course successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] ConditionalExpression
src/course/course.service.ts:68:9
     // <-- async
     const result = await this.coursesRepository.delete(id);
 
-    if (result.affected === 0) {
+    if (false) {
       throw new NotFoundException(`Course with ID ${id} not found`);
     }
killedBy: CourseService should throw a NotFoundException if no course was deleted (affected: 0)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
src/course/course.service.ts:68:9
     // <-- async
     const result = await this.coursesRepository.delete(id);
 
-    if (result.affected === 0) {
+    if (result.affected !== 0) {
       throw new NotFoundException(`Course with ID ${id} not found`);
     }
killedBy: CourseService should delete a course successfully
statusReason: Error: expect(received).resolves.toBeUndefined()

Received promise rejected instead of resolved
Rejected to value: [NotFoundException: Course with ID 1 not found]

[Killed] StringLiteral
src/course/course.service.ts:69:35
     const result = await this.coursesRepository.delete(id);
 
     if (result.affected === 0) {
-      throw new NotFoundException(`Course with ID ${id} not found`);
+      throw new NotFoundException(``);
     }
   }
killedBy: CourseService should throw a NotFoundException if no course was deleted (affected: 0)
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Course with ID 99 not found"
Received message:   "Not Found"

      148 |         } else {
      149 |           stryCov_9fa48("29");
    > 150 |           throw new NotFoundException(stryMutAct_9fa48("30") ? `` : (stryCov_9fa48("30"), `Course with ID ${id} not found`));
