[Killed] BlockStatement
src/lesson/lesson.service.ts:17:67
   ) {}
 
   // 1. Створити урок (POST)
-  async create(createLessonDto: CreateLessonDto): Promise<Lesson> {
-    const newLesson = this.lessonsRepository.create(createLessonDto);
-    return this.lessonsRepository.save(newLesson);
-  }
+  async create(createLessonDto: CreateLessonDto): Promise<Lesson> {}
 
   // 2. Отримати список усіх уроків (GET /)
killedBy: LessonService 2. should create a lesson and call save
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"content": "New Content", "courseId": 1, "title": "New Lesson"}

Number of calls: 0

[Killed] BlockStatement
src/lesson/lesson.service.ts:23:38
   }
 
   // 2. Отримати список усіх уроків (GET /)
-  async findAll(): Promise<Lesson[]> {
-    
-    return this.lessonsRepository.find({ relations: ['course'] });
-  }
+  async findAll(): Promise<Lesson[]> {}
 
   // 3. Отримати урок за ID (GET /:id)
killedBy: LessonService 3. should return all lessons with relations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"relations": ["course"]}

Number of calls: 0

[Killed] ArrayDeclaration
src/lesson/lesson.service.ts:25:53
   // 2. Отримати список усіх уроків (GET /)
   async findAll(): Promise<Lesson[]> {
     
-    return this.lessonsRepository.find({ relations: ['course'] });
+    return this.lessonsRepository.find({ relations: [] });
   }
 
killedBy: LessonService 3. should return all lessons with relations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "relations": Array [
-     "course",

[Killed] ObjectLiteral
src/lesson/lesson.service.ts:25:40
   // 2. Отримати список усіх уроків (GET /)
   async findAll(): Promise<Lesson[]> {
     
-    return this.lessonsRepository.find({ relations: ['course'] });
+    return this.lessonsRepository.find({});
   }
 
killedBy: LessonService 3. should return all lessons with relations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "relations": Array [
-     "course",

[Killed] BlockStatement
src/lesson/lesson.service.ts:29:46
   }
 
   // 3. Отримати урок за ID (GET /:id)
-  async findOne(id: number): Promise<Lesson> {
-    const lesson = await this.lessonsRepository.findOne({
-      where: { id },
-      relations: ['course'],
-    });
-
-    if (!lesson) {
-      throw new NotFoundException(`Lesson with ID ${id} not found`);
-    }
-    return lesson;
-  }
+  async findOne(id: number): Promise<Lesson> {}
 
   // 4. Оновити урок (PUT /:id)
killedBy: LessonService 4. should return a single lesson by id with relations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"relations": ["course"], "where": {"id": 1}}

Number of calls: 0

[Killed] StringLiteral
src/lesson/lesson.service.ts:32:19
   async findOne(id: number): Promise<Lesson> {
     const lesson = await this.lessonsRepository.findOne({
       where: { id },
-      relations: ['course'],
+      relations: [""],
     });
 
killedBy: LessonService 4. should return a single lesson by id with relations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "relations": Array [
-     "course",

[Killed] ConditionalExpression
src/lesson/lesson.service.ts:35:9
       relations: ['course'],
     });
 
-    if (!lesson) {
+    if (false) {
       throw new NotFoundException(`Lesson with ID ${id} not found`);
     }
killedBy: LessonService 5. should throw NotFoundException if lesson is not found (findOne)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] BlockStatement
src/lesson/lesson.service.ts:35:18
       relations: ['course'],
     });
 
-    if (!lesson) {
-      throw new NotFoundException(`Lesson with ID ${id} not found`);
-    }
+    if (!lesson) {}
     return lesson;
   }
killedBy: LessonService 5. should throw NotFoundException if lesson is not found (findOne)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] BlockStatement
src/lesson/lesson.service.ts:42:74
   }
 
   // 4. Оновити урок (PUT /:id)
-  async update(id: number, updateData: Partial<Lesson>): Promise<Lesson> {
-    const lesson = await this.lessonsRepository.findOneBy({ id });
-
-    if (!lesson) {
-      throw new NotFoundException(`Lesson with ID ${id} not found`);
-    }
-
-    Object.assign(lesson, updateData);
-    return this.lessonsRepository.save(lesson);
-  }
+  async update(id: number, updateData: Partial<Lesson>): Promise<Lesson> {}
 
   // 5. Видалити урок (DELETE /:id)
killedBy: LessonService 6. should update a lesson
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/lesson/lesson.service.ts:45:9
   async update(id: number, updateData: Partial<Lesson>): Promise<Lesson> {
     const lesson = await this.lessonsRepository.findOneBy({ id });
 
-    if (!lesson) {
+    if (true) {
       throw new NotFoundException(`Lesson with ID ${id} not found`);
     }
killedBy: LessonService 6. should update a lesson
statusReason: NotFoundException: Lesson with ID 1 not found

[Killed] StringLiteral
src/lesson/lesson.service.ts:46:35
     const lesson = await this.lessonsRepository.findOneBy({ id });
 
     if (!lesson) {
-      throw new NotFoundException(`Lesson with ID ${id} not found`);
+      throw new NotFoundException(``);
     }
 
killedBy: LessonService 7. should throw NotFoundException on update if lesson not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Lesson with ID 99 not found"
Received message:   "Not Found"

      118 |         } else {
      119 |           stryCov_9fa48("51");
    > 120 |           throw new NotFoundException(stryMutAct_9fa48("52") ? `` : (stryCov_9fa48("52"), `Lesson with ID ${id} not found`));

[Killed] BlockStatement
src/lesson/lesson.service.ts:54:43
   }
 
   // 5. Видалити урок (DELETE /:id)
-  async remove(id: number): Promise<void> {
-    const result = await this.lessonsRepository.delete(id);
-
-    if (result.affected === 0) {
-      throw new NotFoundException(`Lesson with ID ${id} not found`);
-    }
-  }
+  async remove(id: number): Promise<void> {}
 }
 
killedBy: LessonService 8. should remove a lesson successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BlockStatement
src/lesson/lesson.service.ts:57:32
   async remove(id: number): Promise<void> {
     const result = await this.lessonsRepository.delete(id);
 
-    if (result.affected === 0) {
-      throw new NotFoundException(`Lesson with ID ${id} not found`);
-    }
+    if (result.affected === 0) {}
   }
 }
killedBy: LessonService 9. should throw NotFoundException if no lesson was deleted (affected: 0)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined
